Revit 2027 API
RevitLinkGraphicsSettings.GetViewDetailLevel Method
 The linked document view detail level of RevitLinkGraphicsSettings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ViewDetailLevel GetViewDetailLevel()
Public Function GetViewDetailLevel As ViewDetailLevel
public:
ViewDetailLevel GetViewDetailLevel()
member GetViewDetailLevel : unit -> ViewDetailLevel
Return Value
ViewDetailLevel
See Also
Reference
RevitLinkGraphicsSettings Class
Autodesk.Revit.DB Namespace